{
  "breaking": [
    {
      "title": "MEGA WEATHER ALERT — Tez Baarish aur Barfbaari aglay 48 ghanton mein",
      "desc": "IMD ne Jammu & Kashmir ke kai ilaqon ke liye aglay 48 ghanton ka strong weather alert jari kar diya hai. Plains par tez baarish aur pahaari ilaqon (Gulmarg, Sonamarg, Kupwara) mein moti barfbaari ka imkaan hai. Local authorities ne rescue teams aur road-clearing squads ko standby par rakha hai. Logon se darkhwast hai ke zaroori saman pehle se tayyar rakhain aur non-essential travel se parhez karein.",
      "time": "Just now",
      "url": ""
    },
    {
      "title": "BORDER SECURITY — Suspicious Drone Movement Near LOC, High Alert",
      "desc": "LOC ke qareeb security agencies ne raat bhar surveillance mein 2 suspicious drone signatures detect kiye. BSF aur local paramilitary units ne area mein patrols aur radar monitoring barhadi hai. Authorities ne public ko sensitive areas se door rehne ki hidayat di hai. High-level security review chal raha hai — further updates aate hi share ki jayengi.",
      "time": "15 minutes ago",
      "url": ""
    },
    {
      "title": "TRAFFIC EMERGENCY — Jammu–Srinagar Highway Temporarily Closed",
      "desc": "Heavy rainfall ke natije mein Jammu–Srinagar highway par landslide hua jiski wajah se highway ko temporarily band kar diya gaya hai. Traffic officials ne drivers ko alternate routes follow karne aur emergency services se raabta rakhne ki salah di hai. Highway restoration teams ab active hain — estimated reopening time abhi confirm nahi hua.",
      "time": "20 minutes ago",
      "url": ""
    }
  ],
  "latest": [
    {
      "title": "Srinagar Smart City — 3 Nai Sadkein Khol Di Gayi",
      "desc": "Srinagar Smart City initiative ke tehat aaj 3 nai sadkein aur smart signaling open ki gayi. Traffic flow mein lagbhag 35% sudhar dekha gaya hai.",
      "time": "1 hour ago",
      "url": ""
    },
    {
      "title": "Tourism Surge — Gulmarg aur Pahalgam Me Booking Increased",
      "desc": "Tourism boards ke mutabiq Gulmarg aur Pahalgam mein is hafte visitors ki tadaad 60% tak barh gayi hai. Local hotels near-full booking par chal rahe hain.",
      "time": "2 hours ago",
      "url": ""
    }
  ],
  "weather": [
    {
      "title": "Snowfall Advisory — Gulmarg & Sonamarg",
      "desc": "IMD ne Gulmarg aur Sonamarg ke liye heavy snowfall advisory jari ki. Travelers se kaha gaya hai ke wo local helplines aur weather updates follow karen.",
      "time": "Just now",
      "url": ""
    }
  ],
  "jobs": [
    {
      "title": "JKSSB Jobs Alert — 1200+ Sarkari Posts Expected",
      "desc": "Jammu & Kashmir administration aglay haftay 1200+ sarkari posts ka notification publish kar sakti hai. Eligible candidates apni documents ready rakhein.",
      "time": "Today",
      "url": "https://jkssb.nic.in/"
    }
  ],
  "alerts": [
    {
      "title": "School Closure Notice — Winter Vacation Extended",
      "desc": "Kuch districts mein schools ke liye winter vacation extension ka order jari hua. Parents local school notices check karen.",
      "time": "Today",
      "url": ""
    }
  ]
}
